Examinator/src/InformationRegisters/РасписаниеОбученияОбщееСУО/РасписаниеОбученияОбщееСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеОбученияОбщееСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РасписаниеОбученияОбщееСУО/ManagerModule.bsl
Функция ВыбратьЭлементыРасписания(НачалоПериода, КонецПериода, Статусы=Неопределено) Экспорт
	
	Запрос = Новый Запрос();

	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасписаниеОбученияОбщееСУО.Мероприятие.Наименование КАК НаименованиеМероприятия,
	               |	РасписаниеОбученияОбщееСУО.ДатаНачалаПроведения,
	               |	РасписаниеОбученияОбщееСУО.ДатаОкончанияПроведения,
	               |	РасписаниеОбученияОбщееСУО.Регистратор КАК ПроведениеОбучения,
	               |	РасписаниеОбученияОбщееСУО.Статус,
	               |	РасписаниеОбученияОбщееСУО.ЦветНаКалендаре
	               |ИЗ
	               |	РегистрСведений.РасписаниеОбученияОбщееСУО КАК РасписаниеОбученияОбщееСУО
	               |ГДЕ
	               |	РасписаниеОбученияОбщееСУО.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ РасписаниеОбученияОбщееСУО.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ (РасписаниеОбученияОбщееСУО.ДатаНачалаПроведения < &НачалоПериода
	               |				И РасписаниеОбученияОбщееСУО.ДатаОкончанияПроведения > &КонецПериода)";
				   
	Если Статусы <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
	               |	И РасписаниеОбученияОбщееСУО.Статус В(&Статусы)";
				   
		Запрос.Параметры.Вставить("Статусы", Статусы);

	КонецЕсли;
				   
	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции
